tap "heroku/brew"
tap "homebrew/bundle"
tap "powershell/tap"
# Cross-platform make
brew "cmake"
# Distributed revision control system
brew "git"
# Modern and intuitive terminal-based text editor
brew "micro"
# Fast, highly customisable system info script
brew "neofetch"
# Feature-rich console based todo list manager
brew "task"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Formula to install PowerShell
brew "powershell/tap/powershell"
vscode "akamud.vscode-theme-onedark"
vscode "bungcip.better-toml"
vscode "dan-c-underwood.arm"
vscode "docsmsft.docs-images"
vscode "formulahendry.code-runner"
vscode "haskell.haskell"
vscode "icrawl.discord-vscode"
vscode "justusadam.language-haskell"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "redhat.java"
vscode "rems-project.tomlitmus"
vscode "sbsnippets.pytorch-snippets"
vscode "shopify.ruby-lsp"
vscode "tonybaloney.vscode-pets"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
